[
    {
        "id": 1,
        "titulo": "Cálculo I",
        "texto": "Cálculo é uma das matérias que mais assustam os universitários, seja pelo o que as outras pessoas dizem sobre suas próprias experiências ou pela necessidade de estar com a matemática em dia para não ter grandes problemas durante a disciplina. \n\n Nesse post, vou falar um pouco sobre a minha experiência e algumas dicas que me ajudaram muito (muito mesmo!)  \n\n ### O que se estuda em cálculo? \n\n Desde o estudo sobre a reta (geometria analítica), funções (que são assuntos que, geralmente, vemos no ensino médio) à limites, derivadas, integrais e bastantes fórmulas e conceitos novos que nos fazem enxergar a matemática de uma forma bem diferente. \n\n De forma bem informal eu descreveria limites como a parte mais complicada de cálculo, pelo fato de que, normalmente, é o primeiro assunto que nos é apresentado em cálculo e acredito que é preciso um pouco de criatividade na hora de resolvê-los, pensar na forma mais simples de resolver e gradualmente ir pensando em estratégias mais refinadas utilizando a matemática básica a seu favor, ao por exemplo, colocar termos em evidência, aplicar Bhaskara, produtos notáveis (etc) às vezes tudo isso é necessário para resolver uma questão, mas às vezes é algo bem mais simples, porém é importante estar preparado. \n\n Depois de passar por limites, derivada vai parecer o arco-íris depois da tempestade. As propriedades são mais simples de entender, e depois de alguma prática se torna automático saber quem é a derivada de quem. Por fim, integrais são basicamente o inverso das derivadas (não no sentido de serem difíceis) mas é porque é basicamente a lógica inversa. Se para derivadas você pergunta *‘Quem é a derivada de x? Vamos dizer que é y’*, Para integrais é *‘Quem é que quando eu derivo dá y? A resposta será x’*.  \n\n ![gif de arco-íris em dia chuvoso](/assets/posts/1/rainbow-68.gif)\n\n Como eu disse antes, é importante que a matemática básica esteja afiada, acredito que grande parte da dificuldade nessa disciplina é o fato da necessidade de estar bem em matemática para que as aplicações do cálculo em limites, derivadas e integrais sejam as principais novidades para o estudante.  \n\n ### Dicas :D \n\n Faça as listas que o seu professor passar, além de provas antigas que poderão te ajudar a ter bagagem na hora de resolver as questões. \n\n Não subestime a matéria, deixando para estudar em última hora, cálculo é uma matéria que necessita de constância e prática para que você não se sinta inseguro ou cometa erros bobos na hora da avaliação. \n\n Utilize a internet ao seu favor, se você sente que pelas aulas do seu professor o seu entendimento não está sendo positivo, experimente pesquisar no Youtube aulas e resoluções de exercícios que podem te auxiliar a compreender a matéria. Além de calculadoras gratuitas que mostram a solução passo a passo de exercícios (recomendo utilizar depois de ter tentado/resolvido alguma questão, pois copiar sem entender pode te prejudicar ao invés de ajudar).  \n\n Tire dúvidas com o seu professor e não perca oportunidades se puder ganhar alguns pontinhos extras. \n\n Por fim, não desista, sei que pode ser uma disciplina desafiadora para muitos, mas acredite, a dedicação aplicada a um desafio em nossas vidas é um aprendizado que extrapola o meio acadêmico. \n\n Boa sorte e, é claro, bons cálculos! \n\n ![gif de personagem de os simpson conversando com os números da matemática.](/assets/posts/1/gifs-de-matematica-1.gif) \n\n"
    },
    {
        "id": 2,
        "titulo": "Álgebra Linear I",
        "texto": "> Em construção... \n\n"
    },
    {
        "id": 3,
        "titulo": "Introdução à Administração",
        "texto": "> Em construção... \n\n"
    },
    {
        "id": 4,
        "titulo": "Arquitetura de Computadores",
        "texto": "> Em construção... \n\n"
    },
    {
        "id": 5,
        "titulo": "Algoritmos Computacionais",
        "texto": "> Em construção... \n\n"
    },
    {
        "id": 6,
        "titulo": "Lógica Matemática",
        "texto": "> Em construção... \n\n"
    },
    {
        "id": 7,
        "titulo": "Cálculo II",
        "texto": "> Em construção... \n\n"
    },
    {
        "id": 8,
        "titulo": "Álgebra Linear II",
        "texto": "> Em construção... \n\n"
    }
]